app/views/cachorros/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select(:lista_raca_id, ListaRaca.all,
                  :id, :nome_raca, {:prompt => 'Selecione...'}, {class: "form-control"}) %>
---
SELECT `lista_racas`.* FROM `lista_racas`