app/controllers/cachorros_controller.rb

SELECT  `cachorros`.* FROM `cachorros` WHERE (nome_cao like '%coco%') LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM `cachorros`
---
  def index
    if params[:pesquisar]
      @cachorros = Cachorro.pesquisa(params[:pesquisar]).paginate(:page => params[:page], :per_page => 50)

INSERT INTO `cachorros` (`castrado`, `nascimento`, `nome_cao`, `nome_dono`, `telefone`, `data_ultima_vez_petshop`, `created_at`, `updated_at`, `lista_raca_id`, `sexo`) VALUES ('nao', '2015-07-08', 'Tobby', 'Barbie', '(34)99999-7765', '2016-07-09', '2017-06-06 15:24:15', '2017-06-06 15:24:15', 22, 'M')
---
  def create
    @cachorro = Cachorro.new(cachorro_params)

    respond_to do |format|
      if @cachorro.save

UPDATE `cachorros` SET `castrado` = 'sim', `updated_at` = '2017-06-06 15:24:34' WHERE `cachorros`.`id` = 1
---
  def update
    respond_to do |format|
      if @cachorro.update(cachorro_params)

DELETE FROM `cachorros` WHERE `cachorros`.`id` = 1001
---
  def destroy
    @cachorro.destroy

SELECT  `cachorros`.* FROM `cachorros` WHERE `cachorros`.`id` = 1001 LIMIT 1
---
    def set_cachorro
      @cachorro = Cachorro.find(params[:id])

SELECT `lista_racas`.* FROM `lista_racas`
---
    def set_lista_raca
      @lista_racas = ListaRaca.all